/*
/*\_________________________________________________________________________________________________
|*												说明											     __≣|
|* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|
|*      此代码由VM模板自动生成																	    |
|*		版本:v0.0.0.1                                                                            |___
|*		日期:2022-07-04 16:21:50                                                                    ≣|
|*																	create by    LCTR              ≣|
|*																	generate by  admin             ≣|
|* ________________________________________________________________________________________________≣|
**/

/**
 * 常量/枚举数据模型字段集合
 *
 * @author admin
 * @date 2022-07-04
 */
export const enum CED_Fields {
  /**
   * Id
   */
  id = 'id',

  /**
   * 所属常量/枚举
   */
  cEId = 'cEId',

  /**
   * 所属常量/枚举
   */
  cEName = 'cEName',

  /**
   * 创建者
   */
  createBy = 'createBy',

  /**
   * 创建时间
   */
  createTime = 'createTime',

  /**
   * 键
   */
  key = 'key',

  /**
   * 描述
   */
  description = 'description',

  /**
   * 备注
   */
  remark = 'remark',

  /**
   * 更新者
   */
  updateBy = 'updateBy',

  /**
   * 更新时间
   */
  updateTime = 'updateTime',

  /**
   * 值
   */
  value = 'value',
}
