/*
/*\_________________________________________________________________________________________________
|*												说明											     __≣|
|* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|
|*      此代码由VM模板自动生成																	    |
|*		版本:v0.0.0.1                                                                            |___
|*		日期:2022-07-04 16:21:50                                                                    ≣|
|*																	create by    LCTR              ≣|
|*																	generate by  admin             ≣|
|* ________________________________________________________________________________________________≣|
**/

/**
 * 常量/枚举数据业务模型
 * <p>Detail</p>
 *
 * @author admin
 * @date 2022-07-04
 */
export interface Detail {
  /**
   * Id
   */
  id: string;

  /**
   * 所属常量/枚举
   */
  cEId: string;

  /**
   * 创建者
   */
  createBy: string;

  /**
   * 创建时间
   */
  createTime: Date;

  /**
   * 键
   */
  key: string;

  /**
   * 描述
   */
  description: string;

  /**
   * 备注
   */
  remark: string;

  /**
   * 更新者
   */
  updateBy: string;

  /**
   * 更新时间
   */
  updateTime: Date;

  /**
   * 值
   */
  value: string;
}
